{
    "name": "Selepe Sello",
    "imageSrc": "./Images/Profile_Img.png",
    "description": "As a BSc Computer Sciences student at UP, I am a dedicated and diligent professional with a passion for Software Engineering, Cyber Security, Cloud Development, and Database Management. I'm also intrigued by Data Science, where I use data to derive valuable insights and inform decisions. My experience includes a Nanodegree in Cloud Development from Udacity, where I honed my skills in designing, building, and deploying scalable and secure cloud applications using AWS services and tools. I also have hands-on experience in Web Development, DevOps, and Testing, which further enhances my software engineering skills. I am a highly motivated individual with excellent communication and interpersonal skills, committed to delivering high-quality work that adds value to any team and aligns with the company's objectives. <br><br> Additionally, I am an open-minded person willing to learn, I am eager to continue learning and applying my skills to real-world problems and challenges, striving for self-discipline and high standards in dealing with professionals. Visit my GitHub profile for a more detailed overview using the link below. I am also capable of working independently or collaboratively with a cost-conscious approach, making me a trustworthy asset to any team.",
    "education": [
        {
            "year": "Feb 2022 - Present",
            "institution": "BSc Computer Sciences",
            "details": "I initially enrolled for BSc Information Systems in 2020 after Matric and Then changed courses in 2022. I am currently enrolled in and passionately pursuing a Bachelor of Science in Computer Sciences at the University of Pretoria, as my goal is to become the finest software developer/engineer. I have completely fallen in love with the field."
        },
        {
            "year": "Aug 2022 - Oct 2022",
            "institution": "AWS Cloud Development",
            "details": "I participated in the ALX-T Cloud Development Nanodegree Program offered by Udacity. This comprehensive course focused on developing, deploying, and testing applications in the cloud, with AWS (Amazon Web Services) as the main focus for the course. During the program, I gained proficiency in various AWS services"
        },
        {
            "year": "Jan 2017 - Dec 2019",
            "institution": "High School (Grade 10-12)",
            "details": "I attended and completed my Grade 12 at Selebalo Secondary School for my high school education and Grade 11 at Tshihlo. I studied and understood combinations of the following subjects: Physical Sciences (PHSC), Mathematics (MATH), Life Sciences (LFSC), Agricultural Sciences (AGRS), and Accounting (ACC)."
        }
    ],
    "experience": [
        {
            "year": "Mar 2024 - Present",
            "position": "Software Developer, Virtu-Tech",
            "details": "I work closely with clients to develop customized solutions. My role involves collaborating with cross-functional teams on various projects, providing technical expertise, and overseeing project execution. We utilize a range of programming languages and tools to deliver effective solutions."
        },
        {
            "year": "Feb 2023 - Feb 2024",
            "position": "Computer Laboratory Technician, UP",
            "details": "I provided support and assistance to the users of the Student Computing Labs, as well as performing tasks like Software installation, server and live casting, Hardware installation, and Computer Hardware assembly to provide an efficient student computing laboratory at University of Pretoria."
        },
        {
            "year": "Jan 2024 - Feb 2024",
            "position": "Web Developer, GAO TEK Inc",
            "details": "As part of our the development interns, I skillfully utilized a combination of WordPress, HTML, CSS, JavaScript, and PHP to meticulously engineer responsive user interfaces, including e-commerce sites powered by WooCommerce. i made use of a local WordPress environment using XAMPP"
        }
    ]
}
