{
    "name": "Selepe Sello",
    "imageSrc": "./Images/Profile_Img.png",
    "description": "As a Software Developer with experience in AWS Cloud Development, Web Development, DevOps, Database Management, and Testing, I apply my problem-solving skills to address real-world challenges. My interest in Cyber Security and Ethical Hacking has broadened my knowledge and skills, enabling me to deliver secure digital solutions. I'm also intrigued by Data Science, where I use data to derive valuable insights and inform decisions. Outside of technology, I engage in chess, art, and design, which contribute to my strategic thinking and creativity. My diverse interests and expertise allow me to make a meaningful impact through innovative solutions. This diverse skill set makes me a valuable addition to any team, ready to contribute and learn in a dynamic environment. <br><br> Additionally, as a STARS Mentor at the University of Pretoria, I guide and inspire aspiring minds on their educational and professional journeys. As Martin Luther King, Jr. once said, 'Life's most persistent and urgent question is, what are you doing for others?' Mentoring is a way to contribute to others by dedicating yourself to your mentee's well-being. Since I enrolled in the STARS mentorship, I have a better appreciation for the importance of mentorship.",
    "education": [
        {
            "year": "Feb 2022 - Present",
            "institution": "BSc Computer Sciences",
            "details": "I initially enrolled for BSc Information Systems in 2020 after Matric and Then changed courses in 2022. I am currently enrolled in and passionately pursuing a Bachelor of Science in Computer Sciences at the University of Pretoria, as my goal is to become the finest software developer/engineer. I have completely fallen in love with the field."
        },
        {
            "year": "Aug 2022 - Oct 2022",
            "institution": "AWS Cloud Development",
            "details": "I participated in the ALX-T Cloud Development Nanodegree Program offered by Udacity. This comprehensive course focused on developing, deploying, and testing applications in the cloud, with AWS (Amazon Web Services) as the main focus for the course. During the program, I gained proficiency in various AWS services"
        },
        {
            "year": "Jan 2017 - Dec 2019",
            "institution": "High School (Grade 10-12)",
            "details": "I attended and completed my Grade 12 at Selebalo Secondary School for my high school education and Grade 11 at Tshihlo. I studied and understood combinations of the following subjects: Physical Sciences (PHSC), Mathematics (MATH), Life Sciences (LFSC), Agricultural Sciences (AGRS), and Accounting (ACC)."
        }
    ],
    "experience": [
        {
            "year": "Mar 2024 - Present",
            "position": "Software Developer, Virtu-Tech",
            "details": "I work closely with clients to develop customized solutions. My role involves collaborating with cross-functional teams on various projects, providing technical expertise, and overseeing project execution. We utilize a range of programming languages and tools to deliver effective solutions."
        },
        {
            "year": "Feb 2023 - Feb 2024",
            "position": "Computer Laboratory Technician, UP",
            "details": "I provided support and assistance to the users of the Student Computing Labs, as well as performing tasks like Software installation, server and live casting, Hardware installation, and Computer Hardware assembly to provide an efficient student computing laboratory at University of Pretoria."
        },
        {
            "year": "Jan 2024 - Feb 2024",
            "position": "Web Developer, GAO TEK Inc",
            "details": "As part of our the development interns, I skillfully utilized a combination of WordPress, HTML, CSS, JavaScript, and PHP to meticulously engineer responsive user interfaces, including e-commerce sites powered by WooCommerce. i made use of a local WordPress environment using XAMPP"
        }
    ]
}
