{
    "name": "Selepe Sello",
    "imagesrc": "./images/tebogoyungmercykay.png",
    "description": "Driven by a passion for solving real-world challenges, I specialize in AWS Cloud Development, DevOps Engineering, Web Development, Database Management, and Software Testing. My curiosity for Cybersecurity and Ethical Hacking fuels my ability to create secure, scalable solutions tailored to the ever-evolving demands of the software industry. Constantly exploring cutting-edge tools and practices, I thrive in dynamic environments that push innovation. <br><br> Equipped with a growing interest in Data Science, I enjoy uncovering actionable insights from data to guide strategic decisions. Outside the realm of technology, my love for chess and art sharpens my creativity and strategic thinking, which I bring into every project and collaboration. <br><br> As a STARS Mentor at the University of Pretoria, I have the privilege of empowering aspiring professionals to achieve their goals. Inspired by Martin Luther King, Jr.'s timeless question, 'What are you doing for others?' I find fulfillment in contributing to others' success, fostering a culture of growth, and building meaningful connections.",
    "education": [
        {
            "year": "Feb 2022 - Present",
            "institution": "BSc Computer Sciences",
            "details": "I initially enrolled for BSc IKS after Matric and Then changed courses in 2022. I am currently enrolled in and passionately pursuing a Bachelor of Science in Computer Sciences at the University of Pretoria, as my goal is to become the finest software developer/engineer. I have completely fallen in love with the field."
        },
        {
            "year": "Oct 2023 - Nov 2023",
            "institution": "Web Development Bootcamp",
            "details": "I participated in an intensive Web Development Bootcamp, where I enhanced my existing skills in building robust websites and web applications. The program strengthened my capabilities in coding, unit testing, and various web technologies, while also instilling and advancing valuable learning methodologies."
        },
        {
            "year": "Aug 2022 - Oct 2022",
            "institution": "AWS Cloud Development",
            "details": "I participated in the ALX-T Cloud Development Nanodegree Program offered by Udacity. This comprehensive course focused on developing, deploying, and testing applications in the cloud, with AWS (Amazon Web Services) as the main focus for the course. During the program, I gained proficiency in various AWS services."
        }
    ],
    "experience": [
        {
            "year": "Mar 2024 - Present",
            "position": "Software Developer, Virtu-Tech",
            "details": "I work closely with clients to develop customized solutions. My role involves collaborating with cross-functional teams on various projects, providing technical expertise, and overseeing project execution. We utilize a range of programming languages and tools to deliver effective solutions."
        },
        {
            "year": "Feb 2023 - Feb 2024",
            "position": "Computer Laboratory Technician, UP",
            "details": "I provided support and assistance to the users of the Student Computing Labs, as well as performing tasks like Software installation, server and live casting, Hardware installation, and Computer Hardware assembly to provide an efficient student computing laboratory at University of Pretoria."
        },
        {
            "year": "Jan 2024 - Feb 2024",
            "position": "Web Developer, GAO TEK Inc",
            "details": "As part of our the development interns, I skillfully utilized a combination of WordPress, HTML, CSS, JavaScript, and PHP to meticulously engineer responsive user interfaces, including e-commerce sites powered by WooCommerce. i made use of a local WordPress environment using XAMPP."
        }
    ]
}