{
    "name": "Selepe Sello",
    "imagesrc": "./images/tebogoyungmercykay.png",
    "description": "Driven by a passion for solving real-world challenges, I specialize in AWS Cloud Development, DevOps Engineering, Web Development, Database Management, and Software Testing. With a keen interest in Cybersecurity and Ethical Hacking, I focus on delivering secure, scalable solutions that meet the ever-evolving demands of the software industry. Constantly exploring cutting-edge tools and practices, I thrive in dynamic environments that foster innovation and growth.<br><br>My growing interest in Data Science fuels my ability to analyze data, uncover actionable insights, and guide strategic decisions. Outside of technology, my love for chess and art sharpens my creativity and strategic thinking, traits I integrate into every project and collaboration.",
    "education": [
        {
            "year": "Feb 2022 - Present",
            "institution": "BSc Computer Sciences",
            "details": "Relevant Coursework: Object-Oriented Programming, Databases, Discrete Mathematics, Operating Systems, Computer Networks, Machine Learning, Compiler Construction, Software Engineering, Concurrent Systems, Assembly, Multimedia, Advanced Data Structures and Algorithms, Artificial Intelligence, Programming Languages."
        },
        {
            "year": "Oct 2023 - Nov 2023",
            "institution": "Web Development Bootcamp",
            "details": "Participated in an intensive Web Development Bootcamp, enhancing skills in building robust websites and web applications. Strengthened capabilities in coding, unit testing, and various web technologies while advancing effective learning methodologies."
        },
        {
            "year": "Aug 2022 - Oct 2022",
            "institution": "AWS Cloud Development",
            "details": "Completed the ALX-T Cloud Development Nanodegree Program, focusing on developing, deploying, and testing applications in the cloud using AWS (Amazon Web Services). Gained proficiency in leveraging various AWS services for application development."
        }
    ],
    "experience": [
        {
            "year": "Mar 2024 - Mar 2025",
            "position": "Software Developer, Virtu-Tech",
            "details": "Designed and implemented scalable, full-stack solutions using modern technologies such as Next.js and Supabase, ensuring optimal performance and maintainability. Enhanced cloud infrastructure and hosting reliability, achieving 99.9% uptime through efficient DevOps practices and optimized resource allocation."
        },
        {
            "year": "Jan 2024 - Feb 2024",
            "position": "Web Developer, GAO TEK Inc",
            "details": "Built an interactive e-commerce platform, integrating custom WordPress plugins and optimizing user interfaces to increase customer engagement by 30%. Developed robust back-end solutions in PHP to handle complex product filtering and search capabilities."
        },
        {
            "year": "Feb 2023 - Feb 2024",
            "position": "Computer Laboratory Technician, UP",
            "details": "Supported over 500 students and 5 administrators by ensuring the smooth operation of computer labs and related systems. Implemented efficient hardware and software installation processes, reducing downtime by 20%."
        }
    ]
}
