[
    {
        "title": "SmartKing Agri",
        "subtitle": "(Next.js: Web Development)",
        "image": "./images/edits/smk-agri.png",
        "bgColor": "#ffffff",
        "description": "<strong>Description:</strong> Developed a custom marketing website for a South African AgriTech startup, showcasing their IoT-based farm monitoring solution. Implemented smooth animations, video integration, and a compelling product narrative that guides users from problem identification to solution adoption.",
        "clientSide": "<strong>Frontend:</strong> Next.js, TypeScript, Tailwind CSS, Responsive Design, Framer Motion",
        "serverSide": "<strong>DevOps:</strong> Vercel Deployment, Image Optimization, SEO Configuration, Performance Tuning",
        "liveLink": "https://www.smartkingagri.com"
    },
    {
        "title": "The Republic",
        "subtitle": "(COS301: Final Year Project)",
        "image": "./images/edits/the-republic.png",
        "description": "<strong>Description:</strong> Built a civic engagement platform enabling citizens to report and track government service delivery issues. Features real-time data visualizations, sentiment analysis, and interactive dashboards providing insights into public sentiment across municipalities.",
        "clientSide": "<strong>Frontend:</strong> Next.js, TypeScript, Radix UI, ECharts, Jest",
        "serverSide": "<strong>Backend:</strong> Node.js, Express.js, Flask, Supabase, Docker, NGINX, WebPack, ESLint",
        "githubLink": "https://github.com/COS301-SE-2024/The-Republic"
    },
    {
        "title": "Compiler Construction",
        "subtitle": "(Python: RecSPL Compiler)",
        "image": "./images/edits/compiler.jpg",
        "description": "<strong>Description:</strong> Engineered a complete compiler for the Recursive Student Programming Language from scratch. Implemented all compiler phases including lexical analysis, parsing, semantic analysis, type checking, and target code generation with comprehensive test coverage.",
        "concepts": "<strong>Technologies:</strong> Python, Lexer, Parser, Scope Analyzer, Type Checker, Code Generator, PyTest, NASM Assembly, Virtual Environment",
        "githubLink": "https://github.com/TebogoYungMercykay/RecSPL-Compiler-Construction-In-Python"
    },
    {
        "title": "Python FastAPI",
        "subtitle": "(Python: RESTful API Development)",
        "image": "./images/edits/fastapi.png",
        "description": "<strong>Description:</strong> Developed a production-ready RESTful API demonstrating modern backend best practices. Features JWT authentication, database migrations, interactive Swagger documentation, and containerized deployment with comprehensive CI/CD pipelines.",
        "concepts": "<strong>Technologies:</strong> FastAPI, PostgreSQL, SQLAlchemy, JWT Authentication, Docker, Heroku, Uvicorn ASGI, GitHub Actions, Alembic Migrations",
        "githubLink": "https://github.com/TebogoYungMercykay/FastAPI-Backend-ML-Service"
    },
    {
        "title": "Serverless Framework",
        "subtitle": "(AWS: Cloud Architecture)",
        "image": "./images/edits/serverless.png",
        "description": "<strong>Description:</strong> Architected a full-stack serverless task management application utilizing AWS services. Implemented secure user authentication, CRUD operations with data isolation, and image attachment capabilities using event-driven architecture patterns.",
        "concepts": "<strong>Technologies:</strong> AWS Lambda, API Gateway, DynamoDB, S3, Auth0, Serverless Framework, IAM, CloudFormation, Node.js",
        "githubLink": "https://github.com/TebogoYungMercykay/AWS-Serverless-Task-Manager-App"
    },
    {
        "title": "Cloud Application",
        "subtitle": "(AWS: Microservices Architecture)",
        "image": "./images/edits/AWS.jpg",
        "description": "<strong>Description:</strong> Designed and deployed a cloud-native image sharing platform using microservices architecture. Implemented user authentication, image upload/processing pipelines, and auto-scaling infrastructure with container orchestration.",
        "clientSide": "<strong>Frontend:</strong> Angular, Ionic, TypeScript",
        "serverSide": "<strong>Backend:</strong> Node.js, Express.js, PostgreSQL (RDS), Amazon S3",
        "concepts": "<strong>DevOps:</strong> Docker, Kubernetes, NGINX Reverse Proxy, HorizontalPodAutoscaler, CI/CD Pipelines",
        "githubLink": "https://github.com/TebogoYungMercykay/Udagram-Image-Social-Microservices"
    },
    {
        "title": "Image Filter",
        "subtitle": "(AWS: Image Processing Microservice)",
        "image": "./images/edits/Cat.png",
        "description": "<strong>Description:</strong> Built a scalable cloud-based image processing API enabling users to upload images and apply filters via RESTful endpoints. Deployed on AWS Elastic Beanstalk with automated scaling and high availability configuration.",
        "concepts": "<strong>Technologies:</strong> Node.js, Express.js, AWS Elastic Beanstalk, IAM, RESTful API Design, Image Processing, CI/CD",
        "githubLink": "https://github.com/TebogoYungMercykay/Udagram_Image_Filtering_Microservice"
    },
    {
        "title": "Concurrent Testing Framework",
        "subtitle": "(Java: Custom Test Runner)",
        "image": "./images/edits/java-testing.jpeg",
        "description": "<strong>Description:</strong> Developed a custom multi-threaded testing framework enabling parallel test execution with configurable execution modes. Demonstrates significant performance improvements over sequential testing through efficient thread pool management.",
        "concepts": "<strong>Technologies:</strong> Java, Gradle, Custom Annotations, ThreadPool Executor, Apache Commons Math, Google Guava, Kotlin DSL, Maven Central",
        "githubLink": "https://github.com/TebogoYungMercykay/Concurrent-Testing-Framework"
    },
    {
        "title": "Relational Databases",
        "subtitle": "(Java: Data Structures)",
        "image": "./images/edits/JavaDSA.jpg",
        "description": "<strong>Description:</strong> Implemented a custom database indexing system using self-organizing Treaps. Combines randomized binary search tree properties with adaptive reorganization to optimize query performance based on access patterns.",
        "concepts": "<strong>Technologies:</strong> Java, Treap, Binary Search Trees, Max Heap, Self-Organizing Data Structures, CRUD Operations, Exception Handling",
        "githubLink": "https://github.com/TebogoYungMercykay/Relational-Database_Using_Self-organizing_Treaps"
    },
    {
        "title": "Computer Networking",
        "subtitle": "(C++: Network Protocol Implementation)",
        "image": "./images/edits/Networking.jpg",
        "description": "<strong>Description:</strong> Built a comprehensive suite of network protocol implementations from scratch, demonstrating deep understanding of networking fundamentals and RFC specifications. Includes fully functional servers for multiple application-layer protocols.",
        "concepts": "<strong>Technologies:</strong> C++, HTTP/1.1, CGI, FTP (Active/Passive), SMTP, POP3, LDAP, Telnet, Socket Programming, RFC Compliance",
        "githubLink": "https://github.com/TebogoYungMercykay/Computer-Networking-In-CPP"
    },
    {
        "title": "Maximum Notion",
        "subtitle": "(Next.js: Web Development)",
        "image": "./images/edits/favicon.svg",
        "bgColor": "#ffffff",
        "description": "<strong>Description:</strong> Executed a complete website transformation for South Africa's leading security services provider. Migrated from WordPress to a custom Next.js implementation, achieving enhanced performance, improved SEO rankings, and zero-downtime hosting migration.",
        "clientSide": "<strong>Frontend:</strong> Next.js, TypeScript, Tailwind CSS, Responsive Design, SEO Optimization",
        "serverSide": "<strong>DevOps:</strong> DNS Zone Management, Hosting Migration, Google Analytics Integration, Performance Monitoring",
        "liveLink": "https://www.maximumnotion.co.za"
    },
    {
        "title": "The Brand Race",
        "subtitle": "(Node.js: Real-Time Multiplayer)",
        "image": "./images/edits/Mario.png",
        "description": "<strong>Description:</strong> Developed a real-time multiplayer game where players compete to identify car brand logos. Features low-latency WebSocket communication, live scoreboards, and persistent leaderboards demonstrating full-stack real-time application development.",
        "clientSide": "<strong>Frontend:</strong> JavaScript (ES6+), HTML5, CSS3, Responsive Design, Real-Time UI Updates",
        "serverSide": "<strong>Backend:</strong> Node.js, Socket.io, Express.js, PHP, MySQL",
        "githubLink": "https://github.com/TebogoYungMercykay/Brand_Race-Local_NodeJS_Socket_Server"
    }
]
